import express, { Express, Request, Response } from "express";
import dotenv from "dotenv";
import chart from "./chart";
import emailSender from "./emailSender";
import processData from "./processDataMy";
import {
  saveAllUsers,
  saveClickedUsers,
  saveNotClickedUser,
} from "./processXl";
import getFileFromDrive, { getLastUsers,jsonTrimer} from "./getFilesFromOneDrive";
import { sendMailWithGraph } from "./sendChartCopyToCompany";

import {
  ConfidentialClientApplication,
  Configuration,
  LogLevel,
} from "@azure/msal-node";
import { Client } from "@microsoft/microsoft-graph-client";
import getStructure from "./processData";
dotenv.config();

const app: Express = express();
const port = process.env.PORT || 3000;
app.use(express.json());

interface Data {
  name: string;
  lastName: string;
  email: string;
  id: number | string;
  matrix: { [key: string]: string };
}

const data =  {
  "Id": 1,
  "Start time": 45545.55306712963,
  "Completion time": 45545.553715277776,
  "Email": "anonymous",
  "თქვენი სახელი": "zaza",
  "თქვენი გვარი": "zaza",
  "კომპანიის დასახელება": "zaza",
  "თანამშრომელთა რაოდენობა კომპანიაში": "2",
  "ელექტრონული ფოსტა (აუცილებელია მიუთითოთ ვალიდური სამსახურებრივი ელ-ფოსტის მისამართი, წინააღმდეგ შემთხვევაში კვლევის მოკლე ანგარიში ვერ გამოგეგზავნებათ)": "zazanozadze425@gmail.com",
  "მოწოდებული ინფორმაცია დამუშავდება „პერსონალურ მონაცემთა დაცვის შესახებ“ საქართველოს კანონის შესაბამისად, წინამდებარე კითხვარიდან მიღებული ინფორმაციის ინტერპრეტაციისა და შედეგების ანგარიშის რესპონდენტი": "ვეთანხმები",
  "პროცესის საზღვრები": "თანამშრომლების ან განყოფილებების საქმიანობის საზღვრები გარკვეულია, მაგრამ მათი ურთიერთქმედების წერტილები მკაფიოდ არ არის განსაზღვრული ან სტანდარტიზებული.",
  "პროცესების აღწერილობები": "კომპანიაში ყველა მნიშვნელოვანი კროს-ფუნქციური პროცესი (რომელშიც მონაწილეობს ორი, ან მეტი სტრუქტურული ერთეული) აღწერილი, დოკუმენტირებული და სტანდარტიზებულია. დოკუმენტირებისთვის გამოყენებულია კომპანიის მასშტაბით შეჯერებული ერთი სტანდარტი.",
  "თამანშრომლების ფუნქციები და როლები": "თანამშრომელთა ფუნქციები და როლები მეტ-ნაკლებად განაწილებული და განსაზღვრულია, კომპანიის სტრუქტურული ერთეულების მიხედვით.",
  "მომხმარებელზე ორიენტირებული ბიზნეს პროცესები": "მომხმარებელთა საჭიროებები ცნობილია და ზუსტად არის განსაზღვრული, თუ რა სურს ან სჭირდება მათ. პროცესების მოდელირება და დიზაინი ხორციელდება მომხმარებლის საჭიროებების მიხედვით.",
  "პროცესების ინდიკატორები": "კომპანიაში ინდიკატორებით იზომება და ფასდება პროცესების შესრულება და შედეგები.",
  "მმართველობის როლი": "კროს-ფუნქციურ პროცესს (რომელშიც ორი ან მეტი სტრუქტურული ერთეული მონაწილეობს) ჰყავს მმართველი, რომელიც პასუხისმგებელია პროცესის შედეგებზე.",
  "გადაწყვეტილებების მიღების პრაქტიკები": "გადაწყვეტილებები მიიღება არსებული ინფორმაციისა და მონაცემების სიღრმისეული მოდელირებისა და ანალიზის საფუძველზე. ბიზნეს-პროცესებისთვის საჭირო სტანდარტული გადაწყვეტილებები მკაფიოდ დელეგირებულია შუა რგოლის მენეჯმენტზე.",
  "პროცესების გაუმჯობესების პრაქტიკები": "პროცესების გაუმჯობესება ხდება კროს-ფუნქციური გუნდების მეშვეობით. გამოიყენება სხვადასხვა მეთოდოლოგიები (Six Sigma, Lean, Agile და სხვა), თუმცა ორგანიზაციაში ერთიანი და სისტემატიზებული პრაქტიკა არ არის დანერგილი.",
  "ინფორმაციული ტექნოლოგიები": "კომპანიის IT სისტემები უზრუნველყოფს კროს-ფუნქციური პროცესების ეფექტიან განხორციელებას.",
  "პროცესებზე დაფუძნებული ორგანიზაციული კულტურა": "ბიზნეს პროცესების მართვა მენეჯმენტის ყოველდღიური საქმიანობის ნაწილია. მენეჯერები აქტიურად იყენებენ ბიზნეს-პროცესებთან დაკავშირებულ ტერმინოლოგიას (მაგ. ინფუთი, აუთფუთი, პროცესების მფლობელი, დანაკარგი).",
  "შეაფასეთ რამდენად ეთანხმებით, ან არ ეთანხმებით მოცემულ დებულებას თქვენი ორგანიზაციის მაგალითზე, 1-დან 7-საფეხურიან სკალაზე. 1 ნიშნავს \"საერთოდ არ ვეთანხმები\", ხოლო 7 - \"სრულიად ვეთანხმები\".\r\n.სტრუქტულ": "2",
  "შეაფასეთ რამდენად ეთანხმებით, ან არ ეთანხმებით მოცემულ დებულებას თქვენი ორგანიზაციის მაგალითზე, 1-დან 7-საფეხურიან სკალაზე. 1 ნიშნავს \"საერთოდ არ ვეთანხმები\", ხოლო 7 - \"სრულიად ვეთანხმები\".\r\n.სტრუქტურუ": "2",
  "შეაფასეთ რამდენად ეთანხმებით, ან არ ეთანხმებით მოცემულ დებულებას თქვენი ორგანიზაციის მაგალითზე, 1-დან 7-საფეხურიან სკალაზე. 1 ნიშნავს \"საერთოდ არ ვეთანხმები\", ხოლო 7 - \"სრულიად ვეთანხმები\".\r\n.სხვადასხვ": "3",
  "შეაფასეთ რამდენად ეთანხმებით, ან არ ეთანხმებით მოცემულ დებულებას თქვენი ორგანიზაციის მაგალითზე, 1-დან 7-საფეხურიან სკალაზე. 1 ნიშნავს \"საერთოდ არ ვეთანხმები\", ხოლო 7 - \"სრულიად ვეთანხმები\".\r\n.სტრუქტურუ1": "3",
  "შეაფასეთ რამდენად ეთანხმებით, ან არ ეთანხმებით მოცემულ დებულებას თქვენი ორგანიზაციის მაგალითზე, 1-დან 7-საფეხურიან სკალაზე. 1 ნიშნავს \"საერთოდ არ ვეთანხმები\", ხოლო 7 - \"სრულიად ვეთანხმები\".\r\n.თანამშრომ": "2",
  "შეაფასეთ რამდენად ეთანხმებით, ან არ ეთანხმებით მოცემულ დებულებას თქვენი ორგანიზაციის მაგალითზე, 1-დან 7-საფეხურიან სკალაზე. 1 ნიშნავს \"საერთოდ არ ვეთანხმები\", ხოლო 7 - \"სრულიად ვეთანხმები\".\r\n.სხვადასხვ1": "3",
  "შეაფასეთ რამდენად ეთანხმებით, ან არ ეთანხმებით მოცემულ დებულებას თქვენი ორგანიზაციის მაგალითზე, 1-დან 7-საფეხურიან სკალაზე. 1 ნიშნავს \"საერთოდ არ ვეთანხმები\", ხოლო 7 - \"სრულიად ვეთანხმები\".\r\n.სხვადასხვ2": "2",
  "შეაფასეთ რამდენად ეთანხმებით, ან არ ეთანხმებით მოცემულ დებულებას თქვენი ორგანიზაციის მაგალითზე, 1-დან 7-საფეხურიან სკალაზე. 1 ნიშნავს \"საერთოდ არ ვეთანხმები\", ხოლო 7 - \"სრულიად ვეთანხმები\".\r\n.როდესაც ს": "3",
  "შეაფასეთ რამდენად ეთანხმებით, ან არ ეთანხმებით მოცემულ დებულებას თქვენი ორგანიზაციის მაგალითზე, 1-დან 7-საფეხურიან სკალაზე. 1 ნიშნავს \"საერთოდ არ ვეთანხმები\", ხოლო 7 - \"სრულიად ვეთანხმები\".\r\n.ზოგადად,": "2",
  "შეაფასეთ რამდენად ეთანხმებით, ან არ ეთანხმებით მოცემულ დებულებას თქვენი ორგანიზაციის მაგალითზე, 1-დან 7-საფეხურიან სკალაზე. 1 ნიშნავს \"საერთოდ არ ვეთანხმები\", ხოლო 7 - \"სრულიად ვეთანხმები\".\r\n.კომპანიაშ": "3",
  "შეაფასეთ რამდენად ეთანხმებით, ან არ ეთანხმებით მოცემულ დებულებას თქვენი ორგანიზაციის მაგალითზე, 1-დან 7-საფეხურიან სკალაზე. 1 ნიშნავს \"საერთოდ არ ვეთანხმები\", ხოლო 7 - \"სრულიად ვეთანხმები\".\r\n.სტრუქტურუ2": "2"
}



const schema=[
  {
      "schema": "პროცესების აღწერილობები",
      "ემბრიონული ბიზნეს პროცესები": "კომპანიაში პროცესების ფორმალური დოკუმენტაცია საერთოდ არ არსებობს, ან ძალიან მწირია.",
      "განმეორებადი ბიზნეს პროცესები": "პროცესები ფრაგმენტულადაა დოკუმენტირებული და უმეტესწილად ასახავენ სტრუქტურული ერთეულების შიდა საქმიანობას.",
      "სტანდარტიზებული ბიზნეს პროცესები": "კომპანიაში ყველა მნიშვნელოვანი კროს-ფუნქციური პროცესი (პროცესი რომელშიც მონაწილეობს ორი, ან მეტი სტრუქტურული ერთეული) აღწერილი, დოკუმენტირებული და სტანდარტიზებულია. არსებობს დოკუმენტირების ერთი, კომპანიის მასშტაბით შეჯერებული სტანდარტი.",
      "მართული ბიზნეს პროცესები": "არსებობს პროცესების დოკუმენტების მართვის ინსტიტუციონალიზებული, მდგრადი პრაქტიკა - ფორმალური წესებითა და მეთოდებით, რომელიც უზრუნველყოფს აღწერილობების დროულ განახლებას, ვერსიების კონტროლს, შენახვას, შესაბამისი დაინტერესებული მხარისთვის სწრაფ გაზიარებას.",
      "ოპტიმიზებული ბიზნეს პროცესები": "პროცესების მოდელირებისთვის და დოკუმენტირებისთვის გამოიყენება ელექტრონული პლატფორმები (მაგ. BPM Suite), რომელიც ინტეგრირებულია კომპანიის სხვადასხვა ინფორმაციულ სისტემებთან; რაც უზრუნველყოფს პროცესების სიმულაციურ ანალიზს, აღწერილობების სწრაფ განახლებას, კროს-ფუნქციურ კოლაბორაციას და ხელმისაწვდომობას."
  },
  {
      "schema": "პროცესის საზღვრები",
      "ემბრიონული ბიზნეს პროცესები": "თანამშრომელთა/სტრუქტურული ერთეულების საქმიანობები ხშირად გაურკვეველია და სიტუაციურად, სპონტანურად იცვლება.",
      "განმეორებადი ბიზნეს პროცესები": "თანამშრომლების/სტრუქტურული ერთეულების საქმიანობის საზღვრები ჩამოყალიბებულია, თუმცა მათ შორის ურთიერთქმედების წერტილები მკაფიოდ არ არის განსაზღვრული/სტანდარტიზებული.",
      "სტანდარტიზებული ბიზნეს პროცესები": "კომპანიის მასშტაბით, სტრუქტურული ერთეულებს შორის კოორდინაციის და ურთიერთქმედების წერტილები მკაფიოდაა განსაზღვრული/სტანდარტიზებული.",
      "მართული ბიზნეს პროცესები": "დეპარტამენტებსა და გუნდებს შორის წინასწარ შეთანხმებულია მომსახურების დონეები, მაგ. რეაგირების დრო, ხარისხი. ამასთანავე კომპანიაში ინსტიტუციონალიზებულია ამ შეთანხმებებისა და პროცესების საზღვრების მდგრადი მათვის მექანიზმი.",
      "ოპტიმიზებული ბიზნეს პროცესები": "პროცესების საზღვრები დინამიური და მოქნილია ბიზნეს გარემოს ცვლილებების და გარე ფაქტორების მიმართ. კომპანიას შეუძლია პროცესების საზღვრების და რესურსების განაწილების სწრაფი ცვლილება, რეალურ დროში მიღებულ ინფორმაციაზე დაყრდნობით."
  },
  {
      "schema": "თამანშრომლების ფუნქციები და როლები",
      "ემბრიონული ბიზნეს პროცესები": "თანამშრომლებს შორის ფუნქცია-მოვალეობები/საქმიანობები მკაფიოდ არაა განაწილებული - მეტ-ნაკლებად ყველა ყველაფერს აკეთებს.",
      "განმეორებადი ბიზნეს პროცესები": "თანამშრომელთა ფუნქციები და როლები მეტ-ნაკლებად განაწილებული და განსაზღვრულია, კომპანიის სტრუქტურული ერთეულების მიხედვით.",
      "სტანდარტიზებული ბიზნეს პროცესები": "თანამშრომელთა როლები და ფუნქციები მკაფიოდაა განსაზღვრული და ერთგვაროვნად აღიქმება კომპანიის მასშტაბით.",
      "მართული ბიზნეს პროცესები": "თანამშრომელთა ფუნქციები და როლები განსაზღვრულია კროს-ფუნქციური პროცესების ანალიზის და დიზაინის საფუძველზე. თანამშრომელთა საქმიანობის დიზაინი უზრუნველყოფს პროცესების მიზნების და დავალებების შესრულებას.",
      "ოპტიმიზებული ბიზნეს პროცესები": "თანამშრომელთა როლები და სამუშაოს დიზაინი დინამიურია და მაქსიმალურად ერგება გარემო ცვლილებებს. პროცესების გაუმჯობესების გუნდებში მონაწილეობა, საუკეთესო პრაქტიკების იდენტიფიცირება და გაზიარება თანამშრომელთა ერთ-ერთი ფორმალური ფუნქციაა."
  },
  {
      "schema": "მომხმარებელზე ორიენტირებული ბიზნეს პროცესები",
      "ემბრიონული ბიზნეს პროცესები": "კომპანიაში არ არის მკაფიო და შეთანხმებული წარმოდგენა, ვინ არიან “ჩვენი საბოლოო მომხმარებლები”. მომხმარებელთა საჭიროებები გათვალისწინებულია არასისტემატურად.",
      "განმეორებადი ბიზნეს პროცესები": "კომპანიაში საკვანძო მომწოდებლები და მომხმარებელთა სეგმენტები ერთმნიშვნელოვნად იდენტიფიცირებულია და ყველასთვის გასაგებია. მიუხედავად იმისა, რომ მომხმარებელთა საჭიროებებს ითვალისწინებენ, კომპანია ძირითადად შიდა საქმიანობაზეა ფოკუსირებული.",
      "სტანდარტიზებული ბიზნეს პროცესები": "მომხმარებელთა საჭიროებები ცნობილია და ზუსტად არის განსაზღვრული, თუ რა სურს ან სჭირდება მათ. პროცესების მოდელირება და დიზაინი ხორციელდება მომხმარებლის საჭიროებების მიხედვით.",
      "მართული ბიზნეს პროცესები": "კომპანიაში დანერგილია მომხმარებლის უკუკავშირის შეგროვების სტრუქტურირებული მექანიზმები. მიღებული ინფორმაცია აქტიურად გამოიყენება პროცესის ანალიზისა და გაუმჯობესებისთვის.",
      "ოპტიმიზებული ბიზნეს პროცესები": "მომხმარებლის გამოცდილების და კმაყოფილების შესახებ ინფორმაცია რეალურ დროში გროვდება შესაბამის ელექტრონულ სისტემებში. მომხმარებლის უკუკავშირი პროცესებისა და პროდუქტების უწყვეტი გაუმჯობესების ერთ-ერთი მთავარი წყაროა."
  },
  {
      "schema": "პროცესების ინდიკატორები",
      "ემბრიონული ბიზნეს პროცესები": "კომპანიაში არ არსებობს საქმიანობის შესრულების ინდიკატორები, და შესაბამისი მონიტორინგი არ ხორციელდება.",
      "განმეორებადი ბიზნეს პროცესები": "კომპანიაში შესრულება უმეტესად ფინანსური ინდიკატორებით (ხარჯი/შემოსავალი) ფასდება, თუმცა ინდიკატორები რეგულარულად არ გამოიყენება შესრულების გასაზომად.",
      "სტანდარტიზებული ბიზნეს პროცესები": "კომპანიაში ინდიკატორებით იზომება და ფასდება პროცესების შესრულება და შედეგები.",
      "მართული ბიზნეს პროცესები": "პროცესების შესრულება იზომება და იმართება სტატისტიკური და რაოდენობრივი მეთოდებით. ინდიკატორები გამოიყენება შესრულების სამართავად და პროცესების ოპტიმიზაციისთვის. ინდიკატორების მოდელირება რეგულარულად ხდება კომპანიის სტრატეგიული მიზნების საფუძველზე.",
      "ოპტიმიზებული ბიზნეს პროცესები": "კომპანიაში შესრულების ინდიკატორების მონიტორინგი მიმდინარეობს რეალურ დროში, ანალიტიკის მოწინავე ტექნოლოგიების, როგორიცაა Business Activity Monitoring (BAM) სისტემები, ხელოვნური ინტელექტი (AI), და მანქანური სწავლების (ML) ალგორითმები. ინდიკატორები იძლევა შესაძლებლობას წინასწარ იდენტიფიცირდეს და აღმოიფხვრას პრობლემები."
  },
  {
      "schema": "მმართველობის როლი",
      "ემბრიონული ბიზნეს პროცესები": "კომპანიაში თანამშრომლების და მენეჯმენტის როლები და ფუნქციები მკაფიოდ გამიჯნული არ არის. მმართველობა უმეტესწილად არაფორმალურია.",
      "განმეორებადი ბიზნეს პროცესები": "სტრუქტურულ ერთეულებს ჰყავთ მენეჯერები განსაზღვრული ფუნქცია-მოვალეობებით, რომლებიც ხელმძღვანელობენ სტრუქტურული ერთეულის შიდა საქმიანობას.",
      "სტანდარტიზებული ბიზნეს პროცესები": "კროს-ფუნქციურ პროცესს (რომელშიც ორი ან მეტი სტრუქტურული ერთეული მონაწილეობს) ჰყავს მმართველი, რომელიც პასუხისმგებელია პროცესის შედეგებზე.",
      "მართული ბიზნეს პროცესები": "ორგანიზაციაში დანერგილია ბიზნეს პროცესების მართვის ერთგვაროვანი პრაქტიკა. პროცესის მმართველის როლი მკაფიოა და მოიცავს პროცესების ანალიზს, ოპტიმიზაციას, დაგეგმვას, რესურსების უზრუნველყოფას და შესრულების მონიტორინგს.",
      "ოპტიმიზებული ბიზნეს პროცესები": "პროცესის მმართველი აქტიურად წაახალისებს გუნდის წევრებს, რათა მათ გამოცადონ ახალი იდეები და წვლილი შეიტანონ პროცესების უწყვეტ გაუმჯობესებაში. პროცესის მმართველი უწყვეტი გაუმჯობესების კულტურის ერთ-ერთი მთავარი შემოქმედია."
  },
  {
      "schema": "გადაწყვეტილებების მიღების პრაქტიკები",
      "ემბრიონული ბიზნეს პროცესები": "კომპანიაში გადაწყვეტილებები ძირითადად ინტუიტურად და სპონტანურად მიიღება, უმეტესწილად კომპანიის დირექტორის მიერ.",
      "განმეორებადი ბიზნეს პროცესები": "მნიშვნელოვანი გადაწყვეტილებები კომპანიაში უფრო ხშირად მიიღება ხარისხობრივ შეფასებებზე დაყრდნობით, ვიდრე რაოდენობრივი მონაცემების ანალიზის საფუძველზე. გადაწყვეტილებები ძირითადად დირექტორის მიერ მიიღება, მაგრამ ზოგჯერ დელეგირებულია მენეჯერებზე, სიტუაციიდან გამომდინარე.",
      "სტანდარტიზებული ბიზნეს პროცესები": "გადაწყვეტილებები მიიღება არსებული ინფორმაციისა და მონაცემების სიღრმისეული მოდელირებისა და ანალიზის საფუძველზე. ბიზნეს-პროცესებისთვის საჭირო სტანდარტული გადაწყვეტილებები მკაფიოდ დელეგირებულია შუა რგოლის მენეჯმენტზე.",
      "მართული ბიზნეს პროცესები": "მნიშვნელოვანი საოპერაციო გადაწყვეტილებების მისაღებად აქტიურად გამოიყენება რაოდენობრივი ინფორმაცია, რომელიც კომპანიის პროცესებიდან მიიღება. პროცესების განხორციელებისთვის საჭირო სტანდარტული გადაწყვეტილებები გარკვეულწილად ავტომატიზებულია და IT სისტემაში ინტეგრირებულია.",
      "ოპტიმიზებული ბიზნეს პროცესები": "გადაწყვეტილებების მისაღებად გამოიყენება საპროგნოზო ანალიტიკა (predictive/prescriptive analytics). პროცესების განხორციელებისთვის საჭირო სტანდარტული გადაწყვეტილებების უმეტესობა ავტომატიზებულია და IT სისტემის მეშვეობით ხორციელდება."
  },
  {
      "schema": "პროცესების გაუმჯობესების პრაქტიკები",
      "ემბრიონული ბიზნეს პროცესები": "კომპანიაში არ არის ორგანიზაციული განვითარების ჩამოყალიბებული პრაქტიკა, ან, თუ არსებობს, ის ფრაგმენტული და არათანმიმდევრულია.",
      "განმეორებადი ბიზნეს პროცესები": "ორგანიზაციაში სტრუქტურული ერთეულების მენეჯერები დაკავებულები არიან უფრო მეტად საკუთარი საქმიანობის ოპტიმიზაციით ვიდრე კროს-ფუნქციური პროცესების გაუმჯობესებით.",
      "სტანდარტიზებული ბიზნეს პროცესები": "პროცესების გაუმჯობესება ხდება კროს-ფუნქციური გუნდების მეშვეობით. გამოიყენება სხვადასხვა მეთოდოლოგიები (Six Sigma, Lean, Agile და სხვა), თუმცა ორგანიზაციაში ერთიანი და სისტემატიზებული პრაქტიკა არ არის დანერგილი.",
      "მართული ბიზნეს პროცესები": "კომპანიაში დანერგილია სისტემური მეთოდოლოგია პროცესების განვითარებისთვის (მაგ., Lean, Six Sigma, Rummler Process Improvement Methodology და ა.შ.). გაუმჯობესების ეფექტიანობა იზომება რაოდენობრივი ინდიკატორებით, რომლებიც შეესაბამება კომპანიის სტრატეგიულ მიზნებს.",
      "ოპტიმიზებული ბიზნეს პროცესები": "არსებული IT სისტემებიდან მიღებული ინფორმაცია მომხმარებლის გამოცდილებისა და პროცესის შესრულების შესახებ აქტიურად გამოიყენება პროცესების გაუმჯობესებისთვის. გაუმჯობესების ციკლი უწყვეტი, სწრაფი და დინამიურია."
  },
  {
      "schema": "ინფორმაციული ტექნოლოგიები",
      "ემბრიონული ბიზნეს პროცესები": "კომპანიაში ინფორმაციული ტექნოლოგიები ნაკლებად გამოიყენება",
      "განმეორებადი ბიზნეს პროცესები": "კომპანიაში არსებული IT სისტემები ფრაგმენტულია და ნაკლებადაა ინტეგრირებული.",
      "სტანდარტიზებული ბიზნეს პროცესები": "კომპანიის IT სისტემები უზრუნველყოფს კროს-ფუნქციური პროცესების ეფექტიან განხორციელებას.",
      "მართული ბიზნეს პროცესები": "კომპანიის IT სისტემები ინტეგრირებულია და არის პროცესების იდენტიფიცირებისა და გაუმჯობესების მნიშვნელოვანი წყარო.",
      "ოპტიმიზებული ბიზნეს პროცესები": "სხვადასხვა ტექნოლოგიები, მათ შორის რობოტული პროცესების ავტომატიზაცია (RPA), ხელოვნური ინტელექტი (AI) და მანქანური სწავლება (ML), ინტეგრირებულია ბიზნეს პროცესებში, რათა ავტომატიზირდეს რუტინული დავალებები და გაიზარდოს ეფექტიანი გადაწყვეტილებების მიღების შესაძლებლობა."
  },
  {
      "schema": "პროცესებზე დაფუძნებული ორგანიზაციული კულტურა",
      "ემბრიონული ბიზნეს პროცესები": "პროცესებზე დაფუძნებული ორგანიზაციული კულტურა",
      "განმეორებადი ბიზნეს პროცესები": "მენეჯმენტი აცნობიერებს საოპერაციო საქმიანობის/ბიზნეს-პროცესების გაუმჯობესების საჭიროებას, თუმცა ბიზნეს-პროცესების შესახებ ცოდნა არაერთგვაროვანია და მწირია.",
      "სტანდარტიზებული ბიზნეს პროცესები": "კომპანიის თანამშრომლებს აქვთ ერთგვაროვანი წარმოდგენა ბიზნეს-პროცესების შესახებ და ასრულებენ დაწესებულ სტანდარტებს.",
      "მართული ბიზნეს პროცესები": "ბიზნეს პროცესების მართვა მენეჯმენტის ყოველდღიური საქმიანობის ნაწილია. მენეჯერები აქტიურად იყენებენ ბიზნეს-პროცესებთან დაკავშირებულ ტერმინოლოგიას (მაგ. ინფუთი, აუთფუთი, პროცესების მფლობელი, დანაკარგი).",
      "ოპტიმიზებული ბიზნეს პროცესები": "ბიზნეს პროცესების გაუმჯობესება თანამშრომლებისთვისაც ყოველდღიური საქმიანობის ნაწილია. ისინი აქტიურად ახდენენ პროცესების გაუმჯობესების იდეების გენერირებას, იდენტიფიცირებენ და იზიარებენ კარგ სამუშაო პრაქტიკებს."
  }
]



const schemaScores=[
  {
      "schema": "პროცესების აღწერილობები",
      "ემბრიონული ბიზნეს პროცესები": 1,
      "განმეორებადი ბიზნეს პროცესები": 2,
      "სტანდარტიზებული ბიზნეს პროცესები": 3,
      "მართული ბიზნეს პროცესები": 4,
      "ოპტიმიზებული ბიზნეს პროცესები": 5
  },
  {
      "schema": "პროცესის საზღვრები",
      "ემბრიონული ბიზნეს პროცესები": 1,
      "განმეორებადი ბიზნეს პროცესები": 2,
      "სტანდარტიზებული ბიზნეს პროცესები": 3,
      "მართული ბიზნეს პროცესები": 4,
      "ოპტიმიზებული ბიზნეს პროცესები": 5
  },
  {
      "schema": "თამანშრომლების ფუნქციები და როლები",
      "ემბრიონული ბიზნეს პროცესები": 1,
      "განმეორებადი ბიზნეს პროცესები": 2,
      "სტანდარტიზებული ბიზნეს პროცესები": 3,
      "მართული ბიზნეს პროცესები": 4,
      "ოპტიმიზებული ბიზნეს პროცესები": 5
  },
  {
      "schema": "მომხმარებელზე ორიენტირებული ბიზნეს პროცესები",
      "ემბრიონული ბიზნეს პროცესები": 1,
      "განმეორებადი ბიზნეს პროცესები": 2,
      "სტანდარტიზებული ბიზნეს პროცესები": 3,
      "მართული ბიზნეს პროცესები": 4,
      "ოპტიმიზებული ბიზნეს პროცესები": 5
  },
  {
      "schema": "პროცესების ინდიკატორები",
      "ემბრიონული ბიზნეს პროცესები": 1,
      "განმეორებადი ბიზნეს პროცესები": 2,
      "სტანდარტიზებული ბიზნეს პროცესები": 3,
      "მართული ბიზნეს პროცესები": 4,
      "ოპტიმიზებული ბიზნეს პროცესები": 5
  },
  {
      "schema": "მმართველობის როლი",
      "ემბრიონული ბიზნეს პროცესები": 1,
      "განმეორებადი ბიზნეს პროცესები": 2,
      "სტანდარტიზებული ბიზნეს პროცესები": 3,
      "მართული ბიზნეს პროცესები": 4,
      "ოპტიმიზებული ბიზნეს პროცესები": 5
  },
  {
      "schema": "გადაწყვეტილებების მიღების პრაქტიკები",
      "ემბრიონული ბიზნეს პროცესები": 1,
      "განმეორებადი ბიზნეს პროცესები": 2,
      "სტანდარტიზებული ბიზნეს პროცესები": 3,
      "მართული ბიზნეს პროცესები": 4,
      "ოპტიმიზებული ბიზნეს პროცესები": 5
  },
  {
      "schema": "პროცესების გაუმჯობესების პრაქტიკები",
      "ემბრიონული ბიზნეს პროცესები": 1,
      "განმეორებადი ბიზნეს პროცესები": 2,
      "სტანდარტიზებული ბიზნეს პროცესები": 3,
      "მართული ბიზნეს პროცესები": 4,
      "ოპტიმიზებული ბიზნეს პროცესები": 5
  },
  {
      "schema": "ინფორმაციული ტექნოლოგიები",
      "ემბრიონული ბიზნეს პროცესები": 1,
      "განმეორებადი ბიზნეს პროცესები": 2,
      "სტანდარტიზებული ბიზნეს პროცესები": 3,
      "მართული ბიზნეს პროცესები": 4,
      "ოპტიმიზებული ბიზნეს პროცესები": 5
  },
  {
      "schema": "პროცესებზე დაფუძნებული ორგანიზაციული კულტურა",
      "ემბრიონული ბიზნეს პროცესები": 1,
      "განმეორებადი ბიზნეს პროცესები": 2,
      "სტანდარტიზებული ბიზნეს პროცესები": 3,
      "მართული ბიზნეს პროცესები": 4,
      "ოპტიმიზებული ბიზნეს პროცესები": 5
  }
]



interface JsonData {
  [key: string]: string | number;
}

app.get("/", async (req: Request, res: Response) => {
  //   const allUsers: JsonData[] = await getFileFromDrive(
  //     "ბიზნეს პროცესების განვითარების ფაზების დიაგნოსტიკის კითხვარი.xlsx"
  //   );

  // const schema = await getFileFromDrive("schema.xlsx");

  // const schemaScores = await getFileFromDrive("schemaScores.xlsx");

  // const validatedSchemaScores = schemaScores.map((scoreObj) => {

  //   const trimedKeys:string[] = Object.keys(scoreObj).map((key) => {
  //     const trimedKey = typeof key === "string" ? key.trim() : key;

  //     return trimedKey;
  //   });

  //   const trimedValues:(string | number)[] = Object.values(scoreObj).map((value, index) => {
  //     const trimedValue= typeof value === "string" ? value.trim() : value;

  //     return trimedValue;
  //   }) as  (string | number)[];

  //   const keyValuePairArray = trimedKeys.map((key, index) => {

  //     const keyNumber: [string, string | number]=key!==trimedKeys[0] && typeof trimedValues[index] === "string"
  //         ? [key, parseInt(trimedValues[index])]
  //         : [key, trimedValues[index]];

  //     return keyNumber;
  //   });

  //   return Object.fromEntries(keyValuePairArray);
  // });


// const schemaJson=jsonTrimer(schema)
  
  // saveAllUsers(data)
  //  if(!req.body)return
  //   const data:Data|undefined=await processData(req.body)
  const mad = {
    name: "ზაზა",
    lastName: "ნოზაძე",
    email: "2",
    id: "2",
    matrix: {
      "პროცესის საზღვრები": "2",
      "პროცესების აღწერილობები": "2",
      "თამანშრომლების ფუნქციები და როლები": "5",
      "მომხმარებელზე ორიენტირებული ბიზნეს პროცესები": "2",
      "პროცესების ინდიკატორები": "3",
      "მმართველობის როლი": "5",
      "გადაწყვეტილებების მიღების პრაქტიკები": "2",
      "პროცესების გაუმჯობესების პრაქტიკები": "4",
      "ინფორმაციული ტექნოლოგიები": "4",
    },
  };
  // const allUsers: JsonData[] = await getFileFromDrive(
  //   "ბიზნეს პროცესების განვითარების ფაზების დიაგნოსტიკის კითხვარი.xlsx"
  // );
  // sendMailWithGraph()

  // allUsers.forEach((user)=>{

  //   processData(user)
  // })

  //   chart(mad);
  //   emailSender(data).catch((e)=>console.log(e))
  // console.log(req.body)


   processData(data,schema,schemaScores)
















  res.send(getStructure(data));
});

// const clicks:any=[]
// console.log(clicks)
// const dataClicked:any={id:'2',email:"zaza@zoz.com",company:'zoro'}

app.get("/tracking", (req, res) => {
  const { id, email, company } = req.query;

  function unixToJulian(unixTimestamp: number) {
    const julianDateStart = 2440587.5;
    const milisecndInDay = 86400000;
    return julianDateStart + unixTimestamp / milisecndInDay;
  }

  const twoWeeksBackInMiliseconds = Date.now();
  const julianDate = unixToJulian(twoWeeksBackInMiliseconds);
  const clickedObject: any = {
    id: id,
    Email: email,
    company: company,
    "Completion time": julianDate,
  };

  const clickedJson = JSON.stringify(clickedObject);
  // console.log(clickedJson)
  saveNotClickedUser();
  // saveClickedUsers(clickedObject)
  // saveAllUsers(data)
  // Record the click event with email
  // clicks.push({ id, email, timestamp: new Date() });
  // console.log(clicks)
  // Redirect to the actual URL
  // const actualUrl = 'https://m.media-amazon.com/images/I/61zcSevCQ1L._AC_UF1000,1000_QL80_.jpg';
  // res.redirect(actualUrl);
  res.end();
});

app.listen(port, () => {
  console.log(`[server]: Server is running at http://localhost:${port}`);
});
